n5/src/Documents/WriteOffForm/WriteOffForm.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>WriteOffForm</name>
  <registerRecords>AccumulationRegister.Expenses</registerRecords>
  <registerRecords>AccumulationRegister.Items</registerRecords>
  <registerRecords>AccountingRegister.General</registerRecords>
  <registerRecords>InformationRegister.RangeStatuses</registerRecords>
  <registerRecords>AccumulationRegister.Cost</registerRecords>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Base</name>
    <type>
      <types>DocumentRef.InvoiceRecord</types>
      <types>DocumentRef.ItemsPurchase</types>
      <types>DocumentRef.ServicesPurchase</types>
    </type>
  </attributes>
  <attributes>
    <name>Capacity</name>
    <type>
      <types>DefinedType.Quantity</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim1</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim2</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim3</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Feature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </attributes>
  <attributes>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>Package</name>
    <type>
      <types>CatalogRef.Packages</types>
    </type>
  </attributes>
  <attributes>
    <name>Product</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductFeature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>CatalogRef.Series</types>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>Range</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </attributes>
</mdclass:Document>

n5/src/Documents/WriteOffForm/Forms/Form/Module.bsl
&AtServer
var AccountData;

// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	readAccount ();
	labelDims ();
	updateChangesPermission ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure updateChangesPermission ()

	Constraints.ShowAccess ( ThisObject );

EndProcedure

&AtServer
Procedure readAccount ()
	
	AccountData = GeneralAccounts.GetData ( Object.ExpenseAccount );
	ExpensesLevel = AccountData.Fields.Level;
	
EndProcedure 

&AtServer
Procedure labelDims ()
	
	i = 1;
	for each dim in AccountData.Dims do
		Items [ "Dim" + i ].Title = dim.Presentation;
		i = i + 1;
	enddo; 
	
EndProcedure 

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		Output.InteractiveCreationRestricted ();
		Cancel = true;
	endif; 
	Options.Company ( ThisObject, Object.Company );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Dim1 show ExpensesLevel > 0;
	|Dim2 show ExpensesLevel > 1;
	|Dim3 show ExpensesLevel > 2
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtClient
Procedure NotificationProcessing ( EventName, Parameter, Source )
	
	if ( EventName = Enum.MessageChangesPermissionIsSaved ()
		and ( Parameter = Object.Ref
			or Parameter = BegOfDay ( Object.Date ) ) ) then
		updateChangesPermission ();
	endif;

EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure DateOnChange ( Item )

	updateChangesPermission ();
	
EndProcedure
